{
  "Connect": "Conectar",
  "Loading Wallet": "",
  "Loading wallet component. Please wait...": "",
  "Check Metamask Extension": "Comprobar la extensión Metamask.",
  "The Metamask wallet extension needs to be installed.": "La extensión de la billetera Metamask debe instalarse.",
  "Check Metamask Status": "Comprobar el estado de Metamask",
  "The Metamask wallet needs to be unlocked.": "La billetera Metamask debe estar desbloqueada.",
  "Check Metamask Network": "Comprobar la red Metamask.",
  "A supported network needs to be selected in the Metamask wallet.": "Se debe seleccionar una red compatible en la billetera Metamask.",
  "Check Metamask Signature": "Comprobar la firma de Metamask.",
  "The login request needs to be signed in the Metamask wallet.": "La solicitud de inicio de sesión debe firmarse en la billetera Metamask.",
  "Connecting to Metamask": "Conexión a Metamask.",
  "Unexpected Error": "Error inesperado.",
  "An error has occured during the wallet status check.": "Ha ocurrido un error durante la verificación del estado de la billetera.",
  "Please try again later.": "Por favor, inténtelo de nuevo más tarde.",
  "The error code was": "El código de error fue ",
  "Wallet Is Locked": "La billetera está bloqueada.",
  "Please unlock your wallet if you want to continue.": "Desbloquee su billetera si desea continuar.",
  "Waiting for the unlock wallet request to be accepted.": "Esperando a que se acepte la solicitud de desbloqueo de la billetera.",
  "Please check your Metamask wallet.": "Por favor revise su billetera Metamask.",
  "Unlock Rejected": "Desbloqueo rechazado",
  "You rejected the unlock wallet request.": "Rechazaste la solicitud de desbloqueo de la billetera.",
  "Please try again if you want to continue.": "Vuelva a intentarlo si desea continuar.",
  "An error has occured during the unlock wallet check.": "Ha ocurrido un error durante la verificación de desbloqueo de la billetera.",
  "Unlock Wallet": "Desbloquear billetera",
  "An error has occured during the network check.": "Se ha producido un error durante la comprobación de la red.",
  "Unsupported Network": "Red no compatible",
  "Current network is not supported by this app.": "La red actual no es compatible con esta aplicación.",
  "If you want to continue, please switch to any supported network. ": "Si desea continuar, cambie a cualquier red compatible.",
  "Waiting for the network switch request to be accepted.": "Esperando a que se acepte la solicitud de cambio de red.",
  "Switch Rejected": "Cambio de Red Rechazado",
  "You rejected the network switch request.": "Ha rechazado la solicitud de cambio de red.",
  "An error has occured during the network switch request.": "Se ha producido un error durante la solicitud de cambio de red.",
  "Switch Network": "Cambiar Red",
  "SIGN_MESSAGE": "¡Saludos desde ReservoApp!\nFirme este mensaje para demostrar que tiene acceso a esta billetera e inicie sesión.\nEste proceso no tiene ningún costo.\nPara evitar que los piratas informáticos usen su billetera, Generaremos un ID de mensaje único que ellos no pueden descifrar:\n",
  "Sign Required": "Firma Requerida",
  "In order to use this app, you need to sign the login request in your wallet.": "Para usar esta aplicación, debe firmar la solicitud de inicio de sesión en su billetera.",
  "Waiting for the login request to be signed.": "Esperando a que se firme la solicitud de inicio de sesión.",
  "Sign Rejected": "",
  "You rejected the sign request.": "Ha rechazado la solicitud de firma.",
  "Sign Timed Out": "Se agotó el tiempo de inicio de sesión",
  "You didn't respond to the sign request in time.": "No respondiste a tiempo a la solicitud de firma.",
  "An error has occured during the sign check.": "Se ha producido un error durante la comprobación de firma.",
  "Signed In": "Registrado",
  "You have successfully signed the login request.": "Ha firmado con éxito la solicitud de inicio de sesión.",
  "Redirecting to app...": "Redireccionando a la dApp...",
  "Sign In": "Iniciar Sesión",
  "Cancel": "Cancelar",
  "Metamask Is Not Detected": "No se detecta Metamask",
  "The Metamask wallet extension is not detected in your browser.": "La extensión de la billetera Metamask no se detecta en su navegador.",
  "In order to use this app, please install the Metamask extension for your browser from the official link below and try again.": "Para usar esta aplicación, instale la extensión Metamask para su navegador desde el enlace oficial a continuación e intente nuevamente.",
  "Dashboard": "Dashboard",
  "Copy Address": "Copiar Dirección",
  "View on Explorer": "Ver en el Explorador",
  "Disconnect": "Desconectar",
  "Address copied.": "Dirección Copiada.",
  "The address of your account has been copied to the clipboard.": "La dirección de su cuenta se ha copiado en el portapapeles.",
  "401 Unauthorized": "401 No Autorizado",
  "You need to connect your wallet to see this page.": "Necesita conectar su billetera para ver esta página."
}
